SELECT 
    "Н_ЛЮДИ"."ИД",
    "Н_ЛЮДИ"."ФАМИЛИЯ",
    "Н_ЛЮДИ"."ИМЯ",
    "Н_ЛЮДИ"."ОТЧЕСТВО",
    "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"::date AS "ДАТА_РОЖДЕНИЯ",
    
    ("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ" + INTERVAL '20 years')::date AS "ДАТА_20_ЛЕТИЯ",
    
    20 AS "ВОЗРАСТ_НА_20_ЛЕТИЕ",
    
    ROUND(AVG(CASE 
        WHEN "Н_ВЕДОМОСТИ"."ОЦЕНКА" ~ '^[1-5]$' THEN CAST("Н_ВЕДОМОСТИ"."ОЦЕНКА" AS numeric)
        ELSE NULL
    END), 2) AS "СРЕДНИЙ_БАЛЛ",
    
    COUNT(CASE 
        WHEN "Н_ВЕДОМОСТИ"."ОЦЕНКА" ~ '^[1-5]$' THEN 1 
        ELSE NULL
    END) AS "КОЛИЧЕСТВО_ОЦЕНОК"
FROM 
    "Н_ЛЮДИ"
    
JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
    
JOIN "Н_УЧЕНИКИ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
    
WHERE "Н_ВЕДОМОСТИ"."ДАТА" >= "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ" + INTERVAL '20 years'
  AND "Н_ВЕДОМОСТИ"."ДАТА" <= "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ" + INTERVAL '21 years' - INTERVAL '1 day'

GROUP BY 
    "Н_ЛЮДИ"."ИД",
    "Н_ЛЮДИ"."ФАМИЛИЯ", 
    "Н_ЛЮДИ"."ИМЯ", 
    "Н_ЛЮДИ"."ОТЧЕСТВО",
    "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"
    
HAVING 
    MIN(CASE 
        WHEN "Н_ВЕДОМОСТИ"."ОЦЕНКА" ~ '^[1-5]$' THEN CAST("Н_ВЕДОМОСТИ"."ОЦЕНКА" AS numeric)
        ELSE 5 
    END) >= 5
    
    AND COUNT(CASE 
        WHEN "Н_ВЕДОМОСТИ"."ОЦЕНКА" ~ '^[1-5]$' THEN 1 
        ELSE NULL 
    END) > 0
    
ORDER BY 
    "Н_ЛЮДИ"."ФАМИЛИЯ", 
    "Н_ЛЮДИ"."ИМЯ", 
    "Н_ЛЮДИ"."ОТЧЕСТВО";
вывести всезх студентов которые были на момент их 20 летия отличниками 