SELECT
    "Н_ЛЮДИ"."ИД",
    "ФАМИЛИЯ", 
    "ИМЯ", 
    "ОТЧЕСТВО", 
    avg(cast("ОЦЕНКА" as numeric)) as "СРЕДНИЙ_БАЛЛ"
FROM 
    "Н_ЛЮДИ"
    JOIN "Н_УЧЕНИКИ" 
        ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД" 
        AND "Н_УЧЕНИКИ"."ГРУППА" = '4100'
    JOIN "Н_ВЕДОМОСТИ" 
        ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД" 
        AND "ОЦЕНКА" NOT IN ('осв', 'неявка', 'зачет', 'незач')
GROUP BY 
    "Н_ЛЮДИ"."ИД", 
    "ФАМИЛИЯ", 
    "ИМЯ", 
    "ОТЧЕСТВО"
HAVING 
    avg(cast("ОЦЕНКА" as numeric)) <= (
        SELECT 
            avg(GRUP.MARK)
        FROM (
            SELECT 
                avg(cast("ОЦЕНКА" as numeric)) as MARK
            FROM 
                "Н_УЧЕНИКИ"
                JOIN "Н_ВЕДОМОСТИ" 
                    ON "Н_УЧЕНИКИ"."ГРУППА" = '1101'
                    AND "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
                    AND "ОЦЕНКА" NOT IN ('осв', 'неявка', 'зачет', 'незач')
        ) GRUP
    )
ORDER BY 
    "СРЕДНИЙ_БАЛЛ" ASC;